First_Routes_and_Controllers/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]