First_Routes_and_Controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Alisa Cheadle"], ["email", "alisacheadle@gmail.com"], ["created_at", "2021-02-03 20:26:32.021963"], ["updated_at", "2021-02-03 20:26:32.021963"]]
---
  def create
    user = User.new(user_params)
    user.save!